Revit 2026 API

# FabricationConfigurationGetFabricationConfiguration Method

---

Gets the fabrication configuration element in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FabricationConfiguration GetFabricationConfiguration(
	Document document
)
```
```vb
Public Shared Function GetFabricationConfiguration (
	document As Document
) As FabricationConfiguration
```
```cpp
public:
static FabricationConfiguration^ GetFabricationConfiguration(
	Document^ document
)
```
```fsharp
static member GetFabricationConfiguration :
        document : Document -> FabricationConfiguration
```

#### Parameters

document Document
     The document.

#### Return Value

FabricationConfiguration The fabrication configuration element in the document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace